[
  {
    "path": "posts/2021-06-28-assignment-vast-challenge-2021/",
    "title": "Assignment - VAST Challenge 2021",
    "description": "[VAST Challenge 2021](https://vast-challenge.github.io/2021/). Applying visual analytics to gain Insight.....",
    "author": [
      {
        "name": "Choo T Tan",
        "url": {}
      }
    ],
    "date": "2021-06-28",
    "categories": [],
    "contents": "\n\nContents\n1.0 Introduction\n2.0 Liteture Review\n3.0 Approach and Overview\n4.0 Preliminary Analysis\n5.0 Data Wrangling5.1 Preparation of Personnel Node\n5.1 Mapping Credit to Loyalty Card\n\n\n\n\n\n\n\n\n1.0 Introduction\nThe assignment is based on VAST Challenge 2021 where it attempted to solve the Mini Challenges 2 (MC2) via visual analytics out of the 3 mini challenges. The fictitious scenario was based on a Tethys-based natural gas production company GAStech in the country of Kronos where it has remarkable profits and strong relationship with the government. However, GAStech has not been as successful in demonstrating environmental stewardship. Several Employee went missing in January 2014 after a successful initial public offering. It was suspected that the disappearance might be associated with an organization known as the Protectors of Kronos (POK). However, things may not be so simplicity. Thus,one is tasked to assist the law enforcement from Kronos and Tethys in solving the assigned task via visual analytics.\n2.0 Liteture Review\n3.0 Approach and Overview\nFor MC2, the main task was to identify suspicious patterns of behavior from the transaction done by GASTech employees. You must cope with uncertainties that result from missing, conflicting, and imperfect data to make recommendations for further investigation.there are 4 main CSV files with Korons geospatial data and it based on last 14 days, 6 - 19 January 2014 prior to the disappearance. The CSV files are namely (1) credit card transaction, (2) loyalty card transaction, (3) geospatial tracking data for company cars which not know to employee, (4) car assignment. The investigation will the following 4 main steps:\nPreliminary Analysis. The intent is to gain insights across the dataset distribution and disparity. A basic understand on the foundation layer.\nData Wrangling. To establish relationship between credit card, loyalty card and geospatial tracking data, To prepare the data for subsequent analysis.\nExploratory Data Analysis (EDA). To identify patterns and anomalies from the transactions and geospatial tracking. Subsequent, to correlate the discovered insights in suitable narrative for further investigation.\n4.0 Preliminary Analysis\nSample of credit and loyalty datasets were shown below. Preliminary, observed that there were more credit than loyalty card transaction. Whether it was a scenario on independent credit card transaction without loyalty card or vice verse was something to be discovered later.Moreover credit card has transaction data time information while loyalty card only has transaction date only. Reference to the respective column datatype, need to covert “timestamp” to datetime/date,“last4ccnum” and loyaltynum\" to factor as technically, it was not a numeric data type. When one explored the “timestamp” data deeper, its observed that the variable has different date format after 13 Jan. i.e. 2014 %Y vs 14 %y. Would need to be clean.\nGlimpse of credit card dataset:\n\nRows: 1,490\nColumns: 4\n$ timestamp  <chr> \"1/6/14 7:28\", \"1/6/14 7:34\", \"1/6/14 7:35\", \"1/6…\n$ location   <chr> \"Brew've Been Served\", \"Hallowed Grounds\", \"Brew'…\n$ price      <dbl> 11.34, 52.22, 8.33, 16.72, 4.24, 4.17, 28.73, 9.6…\n$ last4ccnum <dbl> 4795, 7108, 6816, 9617, 7384, 5368, 7253, 4948, 9…\n\nGlimpse of loyalty card dataset:\n\nRows: 1,392\nColumns: 4\n$ timestamp  <chr> \"1/6/14\", \"1/6/14\", \"1/6/14\", \"1/6/14\", \"1/6/14\",…\n$ location   <chr> \"Brew've Been Served\", \"Brew've Been Served\", \"Ha…\n$ price      <dbl> 4.17, 9.60, 16.53, 11.51, 12.93, 4.27, 11.20, 15.…\n$ loyaltynum <chr> \"L2247\", \"L9406\", \"L8328\", \"L6417\", \"L1107\", \"L40…\n\n\n\n\nReference to the company employee records in challenge 1, GASTech has 54 staffs. However when do a unique count on the credit and loyalty card numbers, it was 55 and 54 count respectively. It alluded that one of the staff could have 2 credit cards. Moreover,a unique count on the number of transaction locations for each dataset has shown that there were 34 and 33 locations for credit and loyalty card respectively. The additional location in credit card dataset was known as “Daily Dealz” with a transaction amount “2.01”.From the transaction price captured respectively in both dataset, interesting to note that the mean was relatively close but min-max and inter-quartile range were quite different.\n\n[1] \"Credit Card PriceTransaction Summary.\"\n    Min.  1st Qu.   Median     Mean  3rd Qu.     Max. \n    2.01    15.13    28.24   207.70    67.18 10000.00 \n[1] \"Loyalty Card Price Transaction Summary.\"\n   Min. 1st Qu.  Median    Mean 3rd Qu.    Max. \n   3.00   13.13   22.84  204.33   38.22 4983.52 \n\nOn the geospatial tracking dateset, similar observation on timestamp data type. Given there were 35 and 5 unique private company car and truck respectively, there would be some transaction credit/loyalty card that would have difficulty to associate it to an individual within the company since not everybody drives. Similar treatment on datatype would have to be done on “Timestamp” and “id”.\nGlimpse of geospatial tracking dataset:\n\nRows: 685,169\nColumns: 4\n$ Timestamp <chr> \"01/06/2014 06:28:01\", \"01/06/2014 06:28:01\", \"01/…\n$ id        <dbl> 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35…\n$ lat       <dbl> 36.07623, 36.07622, 36.07621, 36.07622, 36.07621, …\n$ long      <dbl> 24.87469, 24.87460, 24.87444, 24.87425, 24.87417, …\n\n5.0 Data Wrangling\n5.1 Preparation of Personnel Node\nThis will be built based on MC1 employee records. Only relevant information will be used.\nGlimpse of personnel information:\n\nRows: 54\nColumns: 9\n$ PersID                <dbl> 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12,…\n$ FirstName             <chr> \"Nils\", \"Lars\", \"Felix\", \"Ingrid\", \"Is…\n$ LastName              <chr> \"Calixto\", \"Azada\", \"Balas\", \"Barranco…\n$ `Veh ID`              <dbl> 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12,…\n$ Gender                <chr> \"Male\", \"Male\", \"Male\", \"Female\", \"Mal…\n$ Department            <chr> \"Information Technology\", \"Engineering…\n$ Appt                  <chr> \"IT Technician\", \"Engineer\", \"Engineer…\n$ MilitaryServiceBranch <chr> NA, \"TethanDefenseForceAir\", \"TethanDe…\n$ MilitaryDischargeType <chr> NA, \"GeneralDischarge\", \"HonorableDisc…\n\n5.1 Mapping Credit to Loyalty Card\nPerform required data wrangling based on observation in Section 4. To resolve the datetime format for timestamp and set the credit card number as factor. In addition, create date, weekday and hour for the credit. For loyalty card, renamed timestamp as date to faciltate inner join later. Similarly change the datatype for “loyaltynum”.\nGlimpse of prepared credit card dataset:\n\nRows: 1,490\nColumns: 8\n$ last4ccnum <fct> 1286, 1286, 1286, 1286, 1286, 1286, 1286, 1286, 1…\n$ timestamp  <dttm> 2014-01-06 08:16:00, 2014-01-06 13:27:00, 2014-0…\n$ date       <chr> \"1/6/14\", \"1/6/14\", \"1/7/14\", \"1/7/14\", \"1/8/14\",…\n$ day        <dbl> 6, 6, 7, 7, 8, 8, 8, 9, 9, 9, 10, 11, 12, 12, 12,…\n$ hr         <dbl> 8, 13, 7, 13, 8, 13, 20, 8, 13, 20, 8, 20, 13, 15…\n$ location   <chr> \"Brew've Been Served\", \"Abila Zacharo\", \"Brew've …\n$ price      <dbl> 14.97, 50.14, 11.92, 45.05, 7.26, 50.36, 62.20, 1…\n$ wkday      <ord> Monday, Monday, Tuesday, Tuesday, Wednesday, Wedn…\n\n\n\n\nGlimpse of prepared loyalty card dataset:\n\nRows: 1,392\nColumns: 4\n$ loyaltynum <fct> L2247, L2247, L2247, L2247, L2247, L2247, L2247, …\n$ date       <chr> \"1/6/14\", \"1/6/14\", \"1/6/14\", \"1/7/14\", \"1/7/14\",…\n$ location   <chr> \"Brew've Been Served\", \"Ouzeri Elian\", \"Frydos Au…\n$ price      <dbl> 4.17, 20.74, 175.87, 12.74, 17.71, 23.12, 14.88, …\n\nInner join for both Datasets. Based on date, location and price for inner join. Thereafter, compute the number of distinct count between a credit-loyalty pair. If respective credit and loyalty cards has more than one distinct pair, imply the credit card owner could be using numerous loyalty cards or vice verse. It note that inner join has 1087 observations, 403 and 305 less than credit and loyalty card transaction respectively. This could imply that individual could only transact with one card due to some reasons. When determine the unique count on both cards and location, it was determined that the unique count for credit and loyalty card remained no change. This imply all possible relationship between both card should be captured within the inner join. On location, the inner join has 2 location less than the credit card transaction, namely, Korons Mart and Daily Dealz. This implied that at any onetime, only one card has been used in those places.\n\n\nijoin <- credit %>%\n  inner_join(loyalty,by=c('date', 'location','price')) %>%\n  group_by(last4ccnum) %>%\n  mutate(ndist = n_distinct(loyaltynum)) %>%\n  ungroup() %>%\n  group_by(loyaltynum) %>%\n  mutate(ndist = if_else(ndist==1,n_distinct(last4ccnum), ndist)) %>%\n  ungroup()\n\nijoin\n\n\n# A tibble: 1,087 x 10\n   last4ccnum timestamp           date     day    hr location    price\n   <fct>      <dttm>              <chr>  <dbl> <dbl> <chr>       <dbl>\n 1 1286       2014-01-06 08:16:00 1/6/14     6     8 Brew've Be… 15.0 \n 2 1286       2014-01-06 13:27:00 1/6/14     6    13 Abila Zach… 50.1 \n 3 1286       2014-01-07 07:54:00 1/7/14     7     7 Brew've Be… 11.9 \n 4 1286       2014-01-07 13:24:00 1/7/14     7    13 Kalami Kaf… 45.0 \n 5 1286       2014-01-08 08:16:00 1/8/14     8     8 Brew've Be…  7.26\n 6 1286       2014-01-08 13:38:00 1/8/14     8    13 Gelatogalo… 50.4 \n 7 1286       2014-01-08 20:12:00 1/8/14     8    20 Ouzeri Eli… 62.2 \n 8 1286       2014-01-09 08:14:00 1/9/14     9     8 Brew've Be… 17.6 \n 9 1286       2014-01-09 13:47:00 1/9/14     9    13 Abila Zach… 48.4 \n10 1286       2014-01-09 20:24:00 1/9/14     9    20 Guy's Gyros 18.3 \n# … with 1,077 more rows, and 3 more variables: wkday <ord>,\n#   loyaltynum <fct>, ndist <int>\n\n\n\n\n\n\n\nBipartite Graph for Credit-Loyalty Pair. group_by was done on the inner join dataset to determine the number of transactions for each unique pairing of credit and loyalty card. To minimise cluttering in discovering the unique pairing respective credit to loyalty card, we have filtered the dataset for distinct pairing count >=2. Will use igraph to built a bipartite graph with nodes as credit and loyalty cards, where the edges connote transaction where both cards were used and the edge weight equal to the number of transactions. The bipartite graph was shown below.\n\n\n\nFigure 1: Bipartite Graph of Credit(Orange) and Loyalty(Pink) Cards.\n\n\n\n\n\n\n",
    "preview": "posts/2021-06-28-assignment-vast-challenge-2021/distill-preview.png",
    "last_modified": "2021-07-11T02:50:09+08:00",
    "input_file": "assignment-vast-challenge-2021.knit.md"
  },
  {
    "path": "posts/2021-06-06-dataviz-makeover-2/",
    "title": "DataViz Makeover 2",
    "description": "The second DataViz MakeOver task for ISSS608: Visual Analytics.\n(Tools: Tableau Desktop 2021.1, Tableau Prep Builder 2021.1 & Office 365 Excel)",
    "author": [
      {
        "name": "Choo T Tan",
        "url": {}
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\n\nContents\n1.0 Introduction\n2.0 Visualisation Critique2.1 Clarity.\n2.2 Aesthetic\n\n3.0 Alternate Visualisation3.1 Assumption\n3.2 Clarity & Aesthetic\n\n4.0 Visualisation Design\n5.0 Step-by-Step Guide5.1 Data Prepartion\n5.2 Main Chart - Bubble Chart\n5.3 Annual Trade Parameters\n5.4 10 Years Trending Chart\n5.5 Interactive Dashboard\n\n6.0 Derived Insights6.1 Analysis via Bubble Chart Motion & Trend/BOT Charts\n6.2 Analysis via Horizon Chart & Trend/BOT Charts\n\n7.0 Summary\n8.0 Recommendation\n\n1.0 Introduction\nThe data visualisation below is taken from the Department of Statistics Singapore. It is “mini”-interactive visualisation showing the major trading partner where it is part of an infographics on Singapore International Trade. Intention is to communicate about Singapore merchandise trade performance with major trading partners in 2020. Our task here is to explore means to enhance the visualisation effects through a makeover exercise. The data used in our work is from the sub-section of Merchandise Trade by Region/Market of the Department of Statistics, Singapore.\n\nFigure1.1. Merchandise Trade of Top 10 Trading Countries for Singapore\n2.0 Visualisation Critique\n2.1 Clarity.\nAssuming the intention was to communicate Singapore trade balance with the major trading partners but generally there was a difficulty in discerning the countries association with trade balance in particular for those overlapping at the boundary between net exporter and importers. The critiques were:\nDifficulty in Discerning Net Importer or Exporter for Country Closed to Boundary. Difficult to associate countries closed to the boundary (i.e. Japan, EU, Malaysia, Korean and United States) as net exporters or importers as the icons overlapped in the diagram and undermined it positional reference to the boundary. On the web interactive mode, it was still difficult to discern for some of the countries due to high opacity colour that do not ease the interpretation with the boundary line. Eventually, one cannot confidently determined the trade balance information for countries like Japan, EU and Korea even in the web version.\nPosition of Axes Header and Values. In quick view, the X axis was deemed to be the “Import” parameter as header at the bottom of the graph was normally associated with the X axis. Given the familiarity with the data, it was identified that the header for X axis was “Export”. Axes header positioning couple with similar colour adoption to the values could improve clarity. Moreover, the header should also include the axis unit symbol. i.e. billion or million\nVisualisation Title. No title in the display graph (noted there was title on the web version) to provide an overview on what the visualisation intent . Nonetheless, the intent could be discerned from the explanation below.\nExplanation in the Last Lead In with “!”. Two sentences in the information box where one remained true in the visualisation while the 2nd on United States do not seem to be truth. If was contradicting for United States given it has higher export as displayed in the visualisation. Its confusing whether United States export has exceeded import only in current context or much earlier. The explanation could be improved to provide better clarity.\n2.2 Aesthetic\nGenerally, it was pleasant and good use of label with similar colour as the bubble. However, it also provided a messy and complicated visual at the areas where the countries overlapped at the boundary. Better treatment could be done to improve aesthetic, such as:\nBubble Sizing. The sizing of the bubble for those with larger trade volume might be overwhelming big. Better treatment could be done on the sizing to improve overall aesthetic especially in the overlapping region.\nColour Contrast and Opacity. Better colour contrast and lower opacity to enhance the visual “readability” especially for those overlapping countries like EU and United States. Quick visual look tends to associate United States label with EU.\nLabel Positioning. Label positioning could be improved to reduce the messy view by positioning closer to the bubble icons. eg United States, EU and Malaysia Labels, they could be swapped in the order and with adjustment to enhance readability and association.\nEnhanced Visual Cue. Many good visual cues have been build in. However, the centre point of the bubble do not really aid the interpretation on whether it was net exporter or importer. One option was to has visual indicator either by colour or text on the bubbles or label to explicitly indicate the type.\n3.0 Alternate Visualisation\nThe proposed alternative design is as follow:\n\n\n3.1 Assumption\nThe intention is to provide marco view in the trade merchandised for the top 10 major trade partners of Singapore from 2011 to 2020. The focus will be on balance of trade (BOT), whether there was a transition of state from Net Exporter to Importer and vice verses for each partner with Singapore over the 10 years. This will be done on an interactive dashboard. The classification of Net Importer or Exporter will be based on annual aggregation and not determine through changes in monthly aggregation.\n3.2 Clarity & Aesthetic\nFour layers will be used:\nLayer 1 - Overview. Title and lead in to explain the visualisation intention, general insight and procedures to interactive with the visualisation.\nLayer 2 - Single Snapshot in Year X. The main Bubble chart. This will be a motion chart from 2011 to 2020 and will act as the main chart for interactive. Similarly to the feedback above, numerous inking via colour, opacity and location will be used to provide a quick visual understanding on which country is a net Exporter and Importer. Ranking for each country will be done to indicate the leading trade merchanised. If one still cannot determine whether a country is in which state, click into the tooltips for information. To avoid over clutter and information overload, total trade values, Yr-to-Yr growth, import and export values will be embedded into the tooltips. Watching the transition over the year, one can over how a country trade position change and state as Exporter / Importer. One can click on the icon to see the motion trail history. However, this provide a snap shot on the trade status at Year X in each time shot.\nLayer 3 - Trending by Year. Focus on trade parameters associated with respective country over 10 years base on main annual parameters. The intention is to provide a macro overview on the pattern over 10yrs based on annual values. There will be two charts, one to indicate trade values and growth, the other on import/export and BOT values over the years. Similarly colour inking and legend will be used to identify exporter and importer. The concern will be the mixing of colour over positive/negative growth rate vs net Exporter/Importer. Symbol will be used to associate with growth. Will keep the chart clean as not to over clutter with labels given a small land estate. The default values will be “Singapore”, it will transit to the respective country when one mouse over the country in the main chart.\nLayer 4 - Trending by Month(Date). This will go slightly deeper in the 10 years import trending by using a modified horizon chart reference to import values. Horizon chart will normal baseline the difference over average values to detect shifting in trend over a long study period. Given our interest is only to determine Net Importer over Exporter, a 50% average value was used. This will be plotted by months so that one can see transition pattern within the year i.e Percent of Import. Similar colour inking to above will be used for consistent design. A single country chart will be used in the main dashboard (baseline on Singapore) for inter comparison. To trigger the chart for respective country, one need to select the country icon in the main chart. Thus, at that stage, one can do visual layering of 3 and 4 for insights. The advantage of layer 3 is that it offers an annual perspective, trade values etc which is lacking in layer 4. i.e. horizon chart focus on insight on import trending based on percentage of import at monthly interval; or how overall state being build up progressively at monthly level. For intra-comparison across the countries, dashboard offers an option for one to navigate into a another dashboard for consolidated view by click on an action button. It is to be note that having high import percent do not imply a country has high trade value or import is growing etc. Such insights required the support of other chart offered in the dashboard.\n4.0 Visualisation Design\nThe final visualisation design can be found on here in Tableau Public.\n5.0 Step-by-Step Guide\n5.1 Data Prepartion\nNo\nStep\nAction\n1\nUse excel to remove all unnecessary data points and information associated with the tables for respective worksheet. Renamed the worksheet to “Import” and “Export” respectively. Keep all the countries variables and data associated from Jan 10 to Dec 20.\n\n2\nLoad the excel file into Tableau Prep Builder. Drag the worksheets on the left into the canvas.\n\n3\nClick the “+” icon for Export and select “Pivot”. Clicking “+” will be a common step to evoke a new flow.\n\n4\nSelect all the date range field. Drag and drop at the “Pivoted Fields” box.\n\n5\nThis is what one will see under “Pivot Results”. One could click on the field to verify the pivot.\n\n6\nDouble click into “Total Merchandised Export…” within the “Variables” column under “Pivot Results” field and replace it with “Singapore”.\n\n7\nEvoke “Clean” from “Pivot1” .\n\n8\nRename the columns in the work areas. i.e. “Variables” to “Country”, “Pivot Names” to “Date”, “Pivot Values” to “Export Values” to align with the data nautre. Change “Export Values” from string to number variables. Repeat Step 3 to 8 for “Import” worksheet.\n\n9\nDrag either “Pivot” box in the canvas to the other box. A “Join” symbol will appear. Drop the box within. Set the variables as in the image for join under the “Applied Join Clause”. Select common parameters to match. One can check under “Summary of Join Results” to see mismatched values that will display as red colour. As the intention is to bring all data over for analysis, select “Joint Type:right” (or all) by clicking the shaded region in the circle.\n\n10\nSimilar to step 7, select “Clean” for the “Join” box in the canvas.\n\n11\nRemove duplicated columns with less variables since it is a Join Right operations. For “Country” column, perform “Clean” to remove extra space.\n\n12\nOn “Country” Column, select “Split Values” and “Custom Split”. This is to extract the country name from the variable.\n\n13\nFrom the Custom Split dialog, type blank \" \" into the separator field and select “2” as field and click “Split”.\n\n14\nTwo new columns will be created where one has only the country name and the other the remaining variables. Amend the second column to ensure it has only “thousand” and “millions” as values.\n\n15\nThe focus next is to clean up and normalise the “Import” and “Export” columns. First,ensure the view state is in “Detail”. Then, double click into the null row (created due to Join) and replaced it with “0”. One notice a “paper clip” symbol beside the new merged row.\n\n16\nThen click into “Export” to “Create Calculated Field” by custom.\n\n17\nType in the formulate show. Intent is to normalise the values to baseline since some “Country” variables at million while mostly are in thousand. Remove the unwanted columns and rename the new column. Repeat the Step 15 - 17 for “Import” column.\n\n18\nCreate new calculated field with naming “Total Values” which is the sum of import and export values.\n\n19\nEvoke “Output” from “Clean”. Set the variables for saving the new data set as hyper for subsequent usage in Tableau Desktop.\n\n5.2 Main Chart - Bubble Chart\nNo\nStep\nAction\n1\nLoad the saved hyper file into Tableau Desktop and drag the saved data sheet into the canvas. Go to a new tableau sheet and create new calculated field “Reference Line”. This will be the same step for subsequent creation of calculated field or new parameter.\n\n2\nType the “SUM([Import Values]}” into text box. “Reference Line” will be used to create the diagonally divider in the chart.\n\n3\nCreate a new calculated field name “Total Values Ranking”. This is to rank the countries based on total trade values in Year X.\n\n4\nCreate a new parameter with name “Top N Partners”. This will be used as filter for the top N Partners based on total trade values since our prepared data comprised all the countries in the original set. To avoid over cluttering, max N=10.\n\n5\nDrag the relevant dimensions and measures variables into the respective shelf as show in the image. Do not alarm to observe just a circle on the graph as Tableau will aggregate the trade values into one point.\n\n6\nDouble click on “Country” dimension at filters shelf to set filter for country. On the “General” tab, filter off “Singapore” since it is part of the data set. Select the “Top” tab, and set the values according to the image. To note, on the “Top” values setting, assign the Parameter created in Step 4 as the value. This will allow user to change the N variable at the interactive dashboard subsequently. Similarly for “Year(Date)”, filter off “2010”.\n\n7\nAccess the “Sum[Export Values]” Marks. Select “Shapes” as chart type.\n\n8\nDrag “Total Values” into Size and “Country” into “Shape”. Click into “Shape” and a new dialog box will appear. Change the “Select Shape Palette” to “Flag” and then assigned the country flag to the relevant data. Prior to this, one should download the country flag icon from the internet and save it in the directory:(“My Tableau Repository”). (Need to create flag folder. The visualisation has been designed using resources (country images) from Flaticon.com by Freepik)\n\n9\nSimilar for “Reference Line” Marks, select “Line”. Drag and drop “Country” into “Detail”. One shall also see a diagonal line in the Reference Line chart.\n\n10\nRight click into Reference Line chart and select “Show Trend Lines”. Repeat, but select “Edit all Trend lines..”\n\n11\nUn-check all the options in the dialog box as aim is to tooltip for trend line. Then, click on the “Color” and “Size” on the “Reference Line” Marks respectively to change “opacity” = 0 and size to smallest. Similarly, click on “Tooltip” and delete the text within.\n\n12\nRight click into the “Reference Line” axis and select “Dual Axis”. Repeat and select “Synchronize Axis”. Both charts will now merge into one. Repeat and deselect “Show Header”.\n\n13\nRight click on the reference line and select “Format”. On the left format panel, click on the Trend lines to create the level of inking on the trend line.(i.e thickness and colour tone) Similarly for “Grid Lines”.\n\n14\nClick on the Y axis and select “Edit Axis”.Fixed the axis value to range Min=0 and Max =80B. Amend the tile of the axis. Repeat for X axis to create a symmetric axis. The Reference Line trend line will split the chart into 2 triangle. So values above diagonal line is deemed as net importer and vice verse.\n\n15\nRight click on X axis and select “Format”. On the left panel, format the default “Font” and title “Font”. This is to create the inking for Net Importer. Then click on “4” to format the axis line to same inking colour through “Column Divider”. Repeat the same for X axis and “Row Divider”.\n\n16\nCreate new calculated field name as “Total Values Ranking” and use the parameter “RANK(SUM([Total Values]),‘desc’)”. Purpose is to rank the country based on total trade values. Repeat for “Export Ranking” and “Import Ranking” calculated field by replacing “Total Values” in the parameter with the appropriate parameters.\n\n17\nCreate new calculated field “Net Importer”. Intention is to determine whether it is net importer or exporter. Use formulator within the text box. Repeat for “Net Exporter”. Similarly, create “Trade Balance(-)” and “Trade Balance(+)”, replace those formulate after “THEN” with “ATTR[COUNTRY]”. This is to create the ink on the Country name based on trade balance outcome. Create “BOT(Exp)” and “BOT(Imp)”, replace after “THEN” with ([Trade Balance]). This to for inking of trade balance values. Lastly, create “Trade Balance” with text field (SUM([Export Values])-SUM([Import Values]))\".\n\n18\nDrag and drop the relevant variables from Table to Marks of SUM(Export Values).\n\n19\nClick “Label” and edit the “Text”. “Insert” relevant variables from the list in the image. Arrange and ink accordingly.\n\n20\nDrag and drop “Total Values” into the same Marks. Click to select “Quick Table Calculation” the “Year over Year Growth”. One can repeat but select “Edit Table Calculation” to learn the settings. This will compute the Yr to Yr Trade Growth.\n\n21\nDouble Click into the newly created field and copy out the formulator within. Using it to create logic for Trade Growth.\n\n22\nCreate a new calculated parameters “Trade Growth(+)” and paste the formulator copied in Step 21 into the text box. Repeat for “Trade Growth(-)” and adjusted the text within.\n\n23\nDrag the remaining variables into the “SUM[Export Values]” Marks and click on “tooltip” Insert accordingly.\n\n24\nDrag “Date” into Pages, click and select “Show Filter”. Follow settings on the images to show the path history only when highlighted.Do the necessary inking.\n\n5.3 Annual Trade Parameters\nNo\nStep\nAction\n1\nStart a new sheet and name “Trade”. Drag “Date” to Column Shelf, “Trade Values” to Rows Shelf. Drag the relevant variables into the “Label” of Trade Values\" Marks. Set the Marks to “Gantt Bar”. Reference above steps on how to format the label. See image on text within the label. Format the tooltip to explain the values at the label. Format the axis for the required inking\n\n2\nFormed “Measure Values” by filtering to only “Export Values” and “Import Values”. Start a new sheet name “BOT”. Drag “Import Values” and “Measure Values” to Row Shelf and “Date” to Column Shelf to form a single chart. Set both Row Marks to “Gantt Bar”. On the Marks of “Measure Values”, drag “Measure Names” into Colours to identify Import and Export variables. Drag “Measure Values” into Label and format accordingly.\n\n3\nOn the Marks of “SUM(Import Values)”. Drag “Trade Balance” into size and “Trade Balance Logic” colour. “Trade Balance Logic” is a new calculated field by combining the logic of “Net Exporter” and “Net Importer” created above. This will act at legend to determine trade balance.\n\n4\nDrag the remaining field into the Mark as the image. Intention is to create a information tooltip related to Export and Import Parameters. See Tooltip text box within. There are two additional new calculated fields. i.e. “Percent of Import” and “Percent of Export”. It compute the percentage of respective field over sum of total values. One can reference to the step in creating Bubble chart for formatting of label, axes etc.\n\n5\nTo create a Singapore Growth KPI, start a new sheet name “KPI”. Drag the variables in the image into the respective shelf. Put “Year[Date]” in Page to synchronize the interactive dashboard later. So when dashboard transit in year, the values will change in accordance. Filtering “Country” as in Step 6 to only Singapore. Select “Text” in the Marks.\n\n6\nClick on one of the “SUM(Total Values)” to select “Percent Difference” for “Quick Table Calculation”. Input the variables based on image. This is to determine Year-to-Year trade growth rate.\n\n7\nRight Click at the variables within the Marks to format them based on the required colour etc.In particular for the Trade Growth, select custom during formatting. Input correct variables as in the image.\n\n5.4 10 Years Trending Chart\nNo\nStep\nAction\n1\nStart a new sheet named as “Trending”. Drag and drop “Date” and “Country” to Columns and Rows shelf respective. Set the “Date” dimension to “Month” where it will transform it to Measure. Filter the Country as Step 6 in Section 5.2.\n\n2\nCreate new calculated field “Percent of Import” with “SUM([Import Values])/SUM([Total Values])” in text box. Format the the parameter “Number” into percent by selecting relevant field as in the image. In the format dialog box, select “Percentage”.\n\n3\nCreate a new calculated field “Total (% Import)”. This is to find the average import values across the tables overtime. Rather than typing “Total([Percent of Import])”, we use 0.5 instead. Create another field name “Difference from Average” with “[Percent of Import]-[Total(% Import)]” as field in text box. Format both to percentage as in Step 2. As we are interested to visual the transition from Net Exporter to Importer and vice verse, 0.5 is used instead. Else use “Total([Percent of Import])” if one interest to find the relative import values compared across the whole data set. The “Difference from Average” will then show deviation from national ave and indicate a transition in new direction.\n\n4\nDrag “Percent of Import” into Row Shelf. Then drag \"“Percent of Import” into the chart area to combine both into a single chart. i.e enable dual axis. Then synchronise both axes. If “Percent of Import” text is “Total([Percent of Import])”, one will need to select it to compute along “Country”. This what one will see.\n\n5\nDrag “Difference from Average” into the Row shelf and set the Marks to “Area”. Drag the variables “AGG(Percent of Import)” and “Total(%Import)” into the Marks. The chart will only have “Difference from Average”.\n\n6\nClick into Label at Marks. Tick the “Show mark labels”. Select “Min/Max” and “Table”. This is to purview the min max values across the chart to determine the no of banding levels for horizon creation later.Then reversed the whole type dy deselecting.\n\n7\nCreate a new Parameter “Horizon Band Size”. Set the values as in the image. This will allow one to creating the banding level subsequently through interactive.\n\n8\nCreate a new calculated field “Horizon +1”. This is to create the required banding by normalizing the “Difference from Average” to the band when difference is positive. See image. Vice Verse, also create the “Horizon -1” by change the required variables.\n\n9\nCreate a new calculated field “Horizon +2”. Input into text box in accordance to the image. Noted the difference as compared to “Horizon +1” where we shifting to the next band. Number of horizon (each increase about 2%) to be created will depend on the observed values in Step 6. Given the data set has extreme values like in Hong Kong and Taiwan, will create up to +3 and -3, and explore the need to do more if required.\n\n10\nConsolidate all the “Horizon” variables created into the Measure Values. Drag it to the Row Shelf and drag “Difference from Average” into the Marks. Format the chart colour via legend to create the required inking on the chart.\n\n11\nDrag the relevant variables into the Marks and format the tooltips accordingly.Thereafter, format the variable numbering format.For those variables assoicated with growth, do compute using “Date”,\n\n5.5 Interactive Dashboard\nNo\nStep\nAction\n1\nStart a new Dashboard page. Use the blank box on the left bottom to create a container layout based on the proposed visualisation design. This is to aid the dropping of chart within. Set the dashboard to automatic on the left. Drag the “Main”, “KPI” and “Trending” sheet to the relevant portion.\n\n2\nEnsure “Year(DATE)” is dragged into Pages in Main and KPI sheets. Create a new parameter “Select Country” at the Trending sheet. Intention is to allow action at “Main” to change the “Country” parameter at “Trending” by Select. This will allow information associated with the country to be display. See image on settings.\n\n3\nDuplicate the Trending sheet and drag the “Country” dimension out from the Rows Shelf. This is to create a dynamic chart based on a single country for Step 2. Create a new calculated field “Country Select”. This is to activate the sheet as above by the created “Parameter” base on country value via “Main”. Refer to text box on the logic.\n\n4\nDrag the new variable into Filter of the duplicated Trending Sheet and one will be prompted to select an option. Select “True”. Duplicate the newly created parameter and calculated field. Naming “Select Country H” and “Country Select H”. (H=hover). Drag the create calculated field into Filter or Trade and BOT sheets.\n\n5\nOn the dashboard top menu, select “Actions” under “Dashboard”. Add an action “Highlight”. This is to allow equvialent year in the relevant chart was also highlighted when one hover over icon at the Main sheets.\n\n6\nSelect “Actions” under “Dashboard”. Add an action “Set Parameters” for the Main sheet to trigger the Trade and BOT sheet to display the chart based on Country hover at Main sheet. Linking to step 4.\n\n7\nRepeat Step 6 but this time is to trigger the Trending sheet to display trending assoicated with the Country selected at Main sheet. Linking to Step 3.\n\n8\nSelect “Animations” under “Format”. Turn on the animations set to 1secs. Transit to the dashboard and start rocking with animations. Good to go!\n\n6.0 Derived Insights\nThe final visualisation design is appended below.\n\n\n6.1 Analysis via Bubble Chart Motion & Trend/BOT Charts\n\nFigure6.2. Bubble Chart for 2011 vs 2020 with History Trail.\n\nGenerally, the bubbles (country trade values) tended to move from bottom right to top right corner from 2011 to 2020, indicating trade growth especially for China (Position 2 at S$102B in 2010 to 1 at S$136B by 2020), pulling away from the 2nd position Malaysia. (Position 1 in 2010 at S$113B and overtaken by China in 2013) It shown our strong trade relationship with China. Interesting to note that the Bubbles seemed to drop towards right bottom corner around 2016. When verified with Singapore trade values and growth, 2016 happened to be lowest trade values in the study period. i.e. at S$870B as compared to high at S$1,005B and S$1,056B in 2014 and 2018 respectively. At 2010, the ratio of Net Exporter to Importer was equal and evolved into 6 to 4 by 2020 with some making last effort to “ditch” their previous state in the last 2 years. Generally, the observations were as follow:\n“Static” - Motion Around the Same Area. Countries like Thailand (Exporter), Hong Kong (Exporter), Japan (Importer) and an extend European (Importer) Union (EU) tended to hover around the a specific area within their zone. Nonetheless, Hong Kong move to the right implied its export value grow slightly over the years (from S$57B in 2010 to S$64B in 2020). EU and Japan move closer to the diagonally boundary (especially EU make a last dashed in 2020 towards the line) but somehow remained to be in similar state (ie Net Importer) throughout the 10 yrs.\nSignificant shift in Position within the Same State.Taiwan(Net Importer) import has grew base on the history trail vertical uplift. (BOT of -S$9.0B in 2010 to -S$24.9B (~177% growth)). Its trade position with Singapore rose from 9 to 5. (i.e. S$45.7B to S$75.2B). Similar China (Exporter) also rose from position 2 to 1 as explained above. On the contrary, Indonesia (Net Exporter) trade transaction has reduced (drop from position 4 in 2010 to 8 by 2020). Reduction by export was much faster than import. (Export dropped from S$57B to S$30B from 2019 to 2020 while import dropped from S$25B to S$19B only) Nonetheless, all remained the same state by end of 2020.\nChange in State. Republic of Korean progressively shifted from Net Importer to Exporter by 2017. Import values rose initially but subsequently drop ~vertically downwards. (i.e. reduction in import values with relatively similar export values). For Malaysia and United States, trade growth with Singapore has increased over the period. Interestingly, both made a last “minute” dashed to cross the diagonally line in the closing end akin to EU. Compared to EU, both succeeded to swap their state. United States changed from Net Importer to Exporter via a diagonally drop in 2020. i.e. increase in export with drop in import values (Export increased by S$9B while import dropped by S$12B from 2019 to 2020). While Malaysia made a vertical shift to the left since 2019 by with a bigger swing in 2020 i.e. reduction in export value with relatively similar import value. (Export dropped via S$10B from 2019 to 2020 with relative constant import )\n6.2 Analysis via Horizon Chart & Trend/BOT Charts\nTo offer another level of details via visualisation through horizon chart, the consolidated horizon chart (excluded Hong Kong due to its extremely high trade balance compared to the rest, thus deemed as outlier) was appended below. To avoid confusion, change of state was determined from annual aggregation level and not when there has been change at monthly aggregation.\n\n\nFrom horizon chart when view at monthly aggregation, 4 countries namely Thailand, Indonesia, Taiwan and China (included Hong Kong) did not change it state with certainty. Republic of Korea, Malaysia and United States do swap their state. All these observations were similar from the bubble chart. However, it was uncertain whether Japan and EU change their state. Additional insights were also gleaned and explained as follow:\nNo change in State 1. China (Net Exporter). Relative consistent percent of import as net Exporter. Trade Balance closer to neutral from 2018 onward with occasional spike. However, in late 2019 to early 2020, import percent increased greater than 50%. In Aug 20, a big spike where percent of import drop from 50.7% in July 20 to 41.2%. It was interesting to determine whether there was seasonal influence as spike in higher export percent seemed to occur in Feb and around Aug from 2017 onward less 2018 and Feb 20. (i.e. China locked down) Overall, China trade with Singapore was on upward trend.\nIndonesia (Net Exporter). Percent of Export has roller coaster. (increased, decreased, increased and decreased but progressively increased at tail end of 2020) From previous analysis, one noted trade values of Indonesia has reduced over the years with shrinking in export more than import. However, in Apr 20, percent of import was 44.2%, the highest percentage over 10 years. Export month-to-month growth in Apr has dropped by 23%. Overall, Indonesia trade with Singapore was on downward trend.\nThailand (Net Exporter). Percent of Import progressively decreased overtimes (lighter colour banding) from the horizon chart. A traditional Exporter where in Apr 20 saw import comprised 58.5% of the total trade values with a month-to-month growth by 82% of import values. When dived in, import values relatively constant from Mar to Apr 20. The spike in percent import was due to drop in Export values. Overall, Thailand trade with Singapore was on upward trend.\nTaiwan (Net Importer). Percent of Import seemed to grow overtime by having lighter colour. Observed a higher growth (lighter banding) from May 20 where similar change also observed in Apr 19. Overall, Taiwan trade with Singapore was on upward trend.\nJapan (Net Importer). Percent of Import reduced overtimes. Attempt to switch state in 2020 given percent of export was higher than 50% from Apr to Aug 20. (Import growth dropped more significant than Export. i.e. -16.8% and -7.63%) However, when aggregated at annual level to determine the state, its failed to switch. Overall, Japan trade with Singapore was on downward trend in the last 2 years.\nEuropean Union (Net Importer). Generally, similar observation as Japan but with a more consistent percentage of import across 2011 to 2019. Attempted to switch state but failed. After Mar 2020, Import growth drop significant as compared to export. This could be attributed numerous lock down in EU countries. Overall, EU trade with Singapore was on downward trend in the last 2 years.\n** Change in State** 1. Malaysia (Net Exporter to Importer). Percent of Import was relatively consistent and lower than 50% (low 40%) till May 2016 where percent of import grew from 42.4% in Apr 2016 to 47.6% with an month-to-month growth of import values by 15.2%. Thereafter, while it was till lower than 50%, the percent of import hovered around high 40% till 2019 where it crossed the 50% mark and by annual aggregation, it was deemed to be a Net Importer. However, percent of import remained to be on low 50% till Apr 2020 where it grew to high sustained 50% mark. The growth in percent do not translate to increase in similar trade values. Interestingly during COVID, the drop in export was higher than the drop in import or vice verses which resulted in a higher percent of import. Overall, Malaysia trade with Singapore was on downward trend in the last 2 years.\nUnited States (Net Importer to Exporter). Traditionally, percent of import was in the 60% till 2016 but still relative high in 50%. Start of decline came in Nov 2019 at 58.1% t0 44.8% in Apr 20. Thereafter, remained in the 40% region with the lowest in Jul 20 at 39.1%. What one could observe was that the drop in import values were much higher than export values which resulted in the change in state eventually. Overall, United States trade with Singapore was on upward trend.\nRepublic of Korea. (Net Importer to Exporter). Generally percent of import reduced overtime till 2017 where eventually, it was transited to be Net Exporter. Similarly, there was a spike in Percent Import from 47.7% in Mar 2020 to 52.4% in Apr 2020. Export has dropped more significant than import. i.e. -17.8% and -9.5% respectively. Overall, Republic of Korea trade with Singapore was on downward trend with an upward in 2020.\n7.0 Summary\nIt was observed how China trade with Singapore has grown overtime where its has pull a significant gap by 202O with other partners. Within the same period, Indonesia trade with Singapore has reduced significant among the major partners. Also Singapore trade relationship with Malaysia and United States has changed mainly due to differing impact on the growth of import and export in the tail end of 2019 to 2020, period where COVID 19 was active. Sudden spike in percent import at Apr 20 for Net Exporter countries like Indonesia and Republic of Korea was due higher reduction in export values as compared to import reduction. On the contrary, Thailand as an Exporter has seen significant increased in import at Apr 20. Generally one could conclude the trade dynamics had changed during the COVID period. With significant reduction in Import from some of the major Net Importer (United States, EU and Japan), it could affect our export to others which caused some partners to have higher percent import during the period. Moreover, reduction in export in particular basic necessity or electronic components could also drive Singapore to look for alternative which would resulted higher import values for those countries (possible Thailand and Taiwan). It will be Interesting to observe whether the norm will remain or change after the COVID period.\n8.0 Recommendation\nMore in depth research and analysis into link and causation on good and services on import and exportwith different partners. So one could have a better appreciation on the changes in trade balance.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-06-20T20:49:54+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-25-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "The first DataViz MakeOver task for ISSS608: Visual Analytics.\n(Tools: Tableau Desktop 2021.1, Tableau Prep Builder 2021.1 & Office 365 Excel)",
    "author": [
      {
        "name": "Choo T Tan",
        "url": {}
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\n\nContents\n1.0 Introduction\n2.0 Visualisation Critique2.1 Clarity\n2.2 Aesthetic\n\n3.0 Alternate Visualisation3.1 Assumption\n3.2 Clarity & Aesthetic\n\n4.0 Visualisation Design\n5.0 Step-by-Step Guid\n6.0 Derived Insights\n7.0 Conclusion\n8.0 Recommendation\n\n1.0 Introduction\nThe data visualisation below is created by using data under the sub-section of Merchandise Trade by Region/Market from the Department of Statistics, Singapore.\n\nFigure1.1. Merchandise Trade of Top Six Trading Countries, 2019-2020\n2.0 Visualisation Critique\n2.1 Clarity\nGeneric Title with NO Lead In. The title do not convey the intent or message behind the visualisation as it us just a generic title indicating the merchandise trade of the top 6 trading countries for Singapore from 2019 to 2020. There is no lead in to explain ] and the reader do not know how the top 6 has been determined. i.e. total trade value from 2019 to 2020 or ..? It is unclear whether it is to provide information on intra and/or inter comparison of trade balance or total trade values over the study period among the countries. Perhaps it could also be used to convey COVID impact on trade transaction among the top 6 trading countries by comparing pre-COVID (2019) to COVID period (2020).\nUnsynchronised Y Axis. An unsynchronised Y axis scale for import / export values across all the charts increases the cognitive load in processing the comparison. By quick view, it is unclear on the ranking order of the top 6 trading countries. It was also difficult to discern the trade balance across the study period for the respective country to Singapore. E.g. Hong Kong export values seemed to be higher than its import for selected 2019 period. However, the truth is that Singapore always has trade surplus with Hong Kong. Thus, misleading perspective is caused by different Y axis scale.\nInconsistent X Axis. The lack of minor markings or grid lines for the X axis have increased the difficulties in determining the exact import/export values over time. e.g. import values for Oct 2020. It is observe that the country chart has varying width even though (less Japan) with same study period. Additional confusion is created where Japan has a shorter period compared to the rest. Its made one wonder whether there are no values during the missing period, so what are the start and end periods. Eventually, how to compare with different time period.\nArea or Bar Chart. From the chart, it is difficult to determine the exact import and export values at specific time period. The X axis lacked the minor marking either by quarterly or monthly. As marking on yearly basis only would pose difficulties to correlate the values across both axes. Moreover, such marking would help to ease the correlation of observed trending over specific events occurred in that time period. Even though time is a continuous variable, given the data points is collated monthly rather than daily, the suitability of an area chart is put in question. i.e would a bar chart at monthly interval be better. Nonetheless, this could be debatable.\n2.2 Aesthetic\nAttention to Details. The font size for country is larger than the title. Moreover, the title alignment seemed to be skewed towards the right due to space extended by the legend. Font size for axis naming and values are relative the same. There is a lack of font typography and hierarchical design. All these made the chart aesthetically non-attractive.\nWhite Space. Personally, there could be too many white spaces among the country charts and the chart sizes are inconsistent. This could be due to the need to repeat Y axis naming for the respective chart and how the 6 charts are combined. More space shall be allocated to the chart where an enlarge chart could provide better clarity and quality on the details within.\nColour of Choice. Technically, one could not really fault the choice of colour for import and export respectively. Presuming the intention of the chart is to determine the trade difference overtime, then colour choice like pink and blue might be better option. Pink could represent the negative connotation. E.g. Pink for import. When one saw pink colour over the area chart, it would connote import was greater than export, something that the designer would like to give a negative connotation.\n3.0 Alternate Visualisation\nThe proposed alternative design is as follow:\n\n\n3.1 Assumption\nThe intention is to provide marco view in the total trade transaction values and growth for Singapore and its top 6 trading countries in 2020 based line against 2019 for Year-over-Year (Y-o-Y) comparison. It shall also ease the understanding on growth at the export and import values for each country. Trend lines over 2020 might also be derived. Nonetheless. the visualisaiton will not focus on insights on trade balance with individual countries so not to make it too clutter.\n3.2 Clarity & Aesthetic\nMeaningful title and lead in will be used. A rotated 90 pyramid chart based on monthly import and export values as variables on the synchronised Y axes will form the base chart. To create symmetrical along X axis, the Y axis will have symmetry end point. Given it is an rotated pyramid chart, Export will be position above the X axis where Import will be below. Rationale is than more export will create trade surplus and vice verse. The main chart will show 2020 trade values (i.e. Bar) where the 2019 values will be overlaid by using a smaller bar. (i.e vertical link) Inking will be done to ease cognitive load in identify “Export” and “Import” areas. The top 6 will also be arranged in a descending order to study the impact across them. Total trade values and growth parameters will also be inked on the chart. Suitable colour contrast, symbol and its size will be used to ease the cognitive load in processing 2019 vs 2020 trade values, negative and positive growth / impact.\n3.2.1 Concerns\nAssociation with Export and Import Location. It has been a long deliberation whether it should be rotated, traditional pyramid chart with time line in the Y axis or stack bar or area chart. The concern on using pyramid chart has been that viewer might quickly associated it with a population chart and it cognitive difficult to read. Concern on rotated pyramid chart will be why import is a negative value which could be counter intuitive. The negative about pyramid chart is that one cannot have a quick overview on the total trade value at respective month as compared to stack chart. Eventually, decided on rotated pyramid chart. Could use different colours for bar chart to connote Import vs Export but worried it could be too colourful. Eventually, other than axis naming, explain in lead in etc, inking of “Export” and “Import” words in the chart is also adopted.\nConfused over 2019 vs 2020 Values. There are too many parameters to play in this visualisation. The main variable shall be 2020 but 2019 is important to determine Y-o-Y growth rate and impact. Hopefully, different symbol, colour contrast and legend should ease the association.\nInformation Overload. To avoid this, attempt to design in 4 layers across the chart.\nFirst Layer. It is the title with lead in to explain the visualisation intent.\nSecond Layer. Marco total trade value and Y-o-Y growth for Singapore and the top 6 countries. (On hindsight, should add the percentage of country trade values to total Singapore trade)\nThird Layer. 2020 Import and Export values for each country overlaywith 2019 values. Intention is to show macro view on impact to growth rate for respective value.\nFourth Layer. Y-o-Y growth for total trade values at monthly level for each country. Understand broad trend line on growth rate over the month in 2020 for each country.\n\n4.0 Visualisation Design\nThe final visualisation design can be found on here in Tableau Public.\n5.0 Step-by-Step Guid\nNo\nStep\nAction\n1\nUse excel to remove all unnecessary data points and information associated with the tables for respective worksheet. Only variables associated with the top 6 countries plus “Total Merchandised…” from Jan 19 to Dec 20 shall be retained.\n\n2\nLoad the excel file into Tableau Prep Builder. Drag the “Export” worksheet on the left into the canvas. Click the “+” icon for Export and select “Pivot”\n\n3\nSelect all the date range field. Drag and drop at the “Pivoted Fields” box.\n\n4\nThis is what one will see under “Pivot Results”. One could click on the field to verify the pivot.\n\n5\nDouble click into “Total Merchandised Export…” within the “Variables” column under “Pivot Results” field. Delete the word “Export”.\n\n6\nRename the columns.i.e “Variables” to “Country”, “Pivot Names” to “Date”, “Pivot Values” to “Export Values”. Repeat Step 2 to 6 for “Import” worksheet. Ensure the field “Total Merchandised..” has the same spelling in both sheets\n\n7\nDrag either “Pivot” box in the canvas to the other box. A “Join” symbol will appear. Drop the box within. Set the parameters for join under the “Applied Join Clause”. One can check under “Summary of Join Results” to see mismatched values that will display as red colour. The join will be simple unless one made mistake in Step 5, else remove the duplicated columns.\n\n8\nClick the “+” icon from the “Join” box in the canvas and select “cleaning”.\n\n9\nSelect “Split Values” and “Automatic Split” from the “Country” Column to extract the country name from the variable. Remove duplicated columns.\n\n10\nChange the data type for the respective column.\n\n11\nClick the “+” icon from the “Clean” box in the canvas and select “Output”. Set the parameters for saving the new data set.\n\n12\nLoad the saved excel into Tableau Desktop and drag the saved sheet into the canvas. Create calculated new field from Import and Export Variables to determine the new variables of Import and Export for year 2019 and 2020 respective. eg “Import 2019”. Multiplied by 1000 to account for the normalised value of “thousand” (removed in Step 9) Step 3 could also be used to instead of this step by pivoting the variable by year.\n\n13\nCreate calculated new field to determine the monthly “Total Trade” by summing the Import and Export variables.\n\n14\nDrag the variables “Country” and “Date” into the Columns as Dimension. Filter “Total Merchandised” from the “Country” dimension. Then change the “YEAR(DATE)” into “MONTH(Date)” to have a monthly x axis wrapped by the Country. Drag the variables “Export 2019”, “Export 2020”, “Import 2019” and “Import 2020” into the Rows as Measures. 4 x Bar Charts for the respective rows variables will be created. Note where the Export Charts are positioned.\n\n15\nSelect “Dual Axis” from the drop down of “SUM(Export 2020)”. This would merge both Export charts. Right click on the Export Y axis and select “Synchronise Axis” to make “Export 2019” and “Export 2020” have similar Y axis scale. Repeat the steps for the Import Measures.\n\n16\nSort the “Country” based on total trade value in a descending order by clicking the “Country” dimension and select the “Sort…” in the drop down, select the parameters based on the displayed image. This is to allow quick visual on the rank order for top 6. It is verified that the similar descending order regardless of period i.e. (2019+2020) or (2020)\n\n17\nAt the Marks shelf, set the same bar size (to become a vertical line) and colour for the “Sum(Import 2019)” and “Sum(Export 2019)” variables. For 2020 variables, lower the colour opacity or could use different colour to represent import and export bar chart respectively.\n\n18\nTo improve clarity for the 2019 values, right click on the any 2019 X axis and select “Move marks to front”.\n\n19\nFor both Y axes, change the range to Fixed and set the end value to “8,100,000,000”. Amend the Axis Title. Set Scale to “Reversed” ONLY for Import Y axis. Intention is to create a symmetrical scale along the x axis to ease comparison.\n\n20\nDrag the variables “Export 2020” into “Export 2020” Marks shelf. Double click into the measure and type “> SUM([Export 2019])”. It will change into a logic Dimension. Assign colour to it.\n\n21\nFor chart, one can observe that when “Export 2020” is less than “Export 2019” (i.e.negative Yr-to-Yr import values), the bar chart will change to pink colour. This is to ease the visualisation on impact. Repeat for “Import 2020”.\n\n22\nRemove unnecessary headers, format the remainder headers, adjust font size, colour, grid lines inking and change the format of “Month(Date)” into “First Letter”.\n\n23\nRight click on the top chart and select “Annotate -> Area” to add “Export” into the chart. Adjust the colour tone and repeat for the Import Chart. Purpose is to do the enhanced the inking on which bar chart represent export or import.\n\n24\nDownload the country flag icon from the internet and save it in the directory:(“My Tableau Repository”). (Need to create flag folder) Drag the “Country” into Columns shelf in a new sheet. At Marks shelf, change the chart into “Shape” and drag “Country” into “Shapes”. Click on the “Shapes” and assigned the respective flag icon to the variable. Repeat for SG flag by using “Total Merchandised” (The visualisation has been designed using resources (country images) from Flaticon.com by Freepik\n\n25\nCreate the calculated field for “Total Trade 2019” based on the image. Repeated for “Total Trade 2020”.\n\n26\nCreate the calculated field for “Annual Growth” a logic measure to determine whether Trade Value in 2020 is more than Trade Value in 2019. Then calculated field for “Annual Growth%” reference to the image. The purpose is to compute annual Y-o-Y growth for each country.\n\n27\nOn a new sheet, drag “Country” and “Total Trade 2020” to Rows shelf. Convert the former to a Dimension with discrete value rather than keep it as Measure. Filter “Country” to only “Total Merchandised” and “Edit Aliases …” to “SG 2020 Total Trade Value:”. Drag “Annual Growth” and “Annual Growth%” into Marks Shelf Colour and Text respectively. The former will create the logic and thus visual contrast to determine whether positive or negative growth. The latter is to compute the growth value. Format the growth value by using custom for number. We will be using icon to represent positive and negative to ease visualisation.\n\n28\nRepeat step 27 but with “SG 2020 Total Trade Value:” filter off from “Country”. Drag the variables into Column rather than Row Shelf.\n\n29\nCreate a Y-o-Y Growth for total trade values on each month in 2020. On the new sheet, drag “Country” and “Date” into Columns Shelf with the required filter and setting to month. drag “Annual Growth%” into Marks Shelf Colour and Size respectively as Measure. This is to create the visual cue for negative / positive values with size to indicate the difference magnitude.\n\n30.\nCombine all the sheets into a dashboard and realign the sheets to achieve the required aesthetics outcome. Add Title, Lead In, Source and Legend to enhance comprehension on the visualisation intent.\n\n6.0 Derived Insights\n\n\nThe derived insights are:\nMostly Negative in Growth. The Y-o-Y growth for the total trade values for SG is negative (i.e-5.20%) followed by it main trading partners in descending order Malaysia (-8.46%), USA (-2.47%), Japan(-1.69%) and China (-0.81%). Nonetheless it is surprising that SG has strong positive growth with Taiwan (+13.04%) and Hong Kong (+5.61%). Moreover, the negative growth in China is deemed to be low given the country has been seriously hit with COVID in early 2020.\nUneven Impact to Monthly Import and Export Values for the Top 6 Countries.\nFront End Negative Impact. China trade is affected generally a bit more on export from Singapore than import during the first 6 mths of 2020. Thereafter, negative import growth for some of the remaining months but the last 6mths has seen relatively strong trade growth due to higher export from Singapore.\nSharp Point Negative Impact. The trade between Singapore and Malaysia have been badly hit during Mar to May 2020. This has been the period where both implemented country lock down such that direct land trade via Johor has been affected. As Malaysia has been implementing a series lock down even after that, one can observe its continue impact to export from Singapore. Overall trade growth has been negative in the last 6 mths of 2020.\nLop-Sided Impact. Generally, Y-o-Y import growth for Singapore to USA in 2020 has generally been negative, while positive for export. Nonetheless, the overall trade growth has been negative due to higher negative growth in import which offset positive growth in export. It is interesting to find out the low import from USA.\nLimited Impact. Interesting, both Taiwan and Hong Kong have mainly experienced positive growth with Singapore. In 2020, both countries have generally been known to have relative small number of COVID cases.\nTail End Negative Impact. Generally, the fluctuation in trade values for Japan has been less drastic. Nonetheless, both import and export values experience negative growth in the last 6 mths of 2020. Somehow it might be correlated to the progressive increase in the number of COVID cases in later part of the year.\n\nTrending for Trade Growth in 2020 base on Monthly Trade Values. From the “Y-o-Y Growth” chart at the bottom of the visualisation, one can use colour and size of the square to have a macro view on the total trade trending between Singapore and each country. Both Taiwan and Hong Kong have seemed to be on a growing trend based on the darker blue and bigger square. China is also progressively growing after the initial dip. Japan trade growth has been dropping steadily. Similar to Malaysia less the high negative growth during Singapore Circuit Breaker. USA has been a roller coaster ride but generally more negative than positive. Somehow, one could correlate the trending to how the country is doing on controlling the spread of COVID within. From the growth chart, one could also outlier growth that explain on a wider range of values for the legend. i.e. negative growth is associated with Singapore and Malaysia lock down; positive growth mainly associated with Hong Kong and Taiwan in Dec. These outliers could have greater deep impact to Singapore overall trade values. It will be interesting to see how the trending will carry on into 2021 where pandemic has generally been controlled in most but no all, as some been hit with second or third wave of COVID attack.eg Taiwan.\n7.0 Conclusion\nThe visualisation has provided a macro view of total merchandised trade values for SG and its top 6 trading partner. A quick insights on the Y-o-Y growth on annual trade values, import and export values for each trading country with SG under the pandemic COVID 19. It also shed marco insight on monthly growth in 2020 showing signs of recovery for selected countries. Nonetheless, the future is still uncertain in this pandemic era as country worry about subsequent COVID attack. Effectively, trade economics can be affected by numerous factors other than COIVD. Thus without deep research and confirmatory analysis,one cannot confidently conclude the negative growth can be fully attributed to the pandemic while selected incidents could.\n8.0 Recommendation\nFuture exploration to enhance understanding on trade growth can focus on 2 areas as follows:\nMicro View on Merchandised Trade. To research on which types of goods and services have resulted in the negative or positive growth with respective country import and export values. With the deeper understanding in quantitative approach, the ability to correlate the insights and discern whether the impact on growth could be attributable to COVID or other international policy or economics dynamics.\nCausation to Growth in Merchandised Trade. COVID 19 can be a causation to the growth insights discerned from the visualisation at the macro level. However, other political or economical factors can impact how good and services flow globally. eg Trade wars between US and China, sequential lock down in Malaysia, Taiwan growing foot print in electronic supply chain etc Need to have deeper research into the qualitative area to understand the impact to Singapore Trade.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-06-07T10:47:31+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to blog, My DataViz Learning Journey! A home where DataViz assignment was documented after burning days and nights on it. Hope that you enjoy learning what has been shared! :-) YOLO",
    "author": [
      {
        "name": "Choo T Tan",
        "url": {}
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-06-06T21:21:00+08:00",
    "input_file": {}
  }
]
