[
  {
    "path": "posts/2021-05-25-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "The first DataViz MakeOver task for ISSS608: Visual Analytics.\n(Tools: Tableau Desktop 2021.1, Tableau Prep Builder 2021.1 & Office 365 Excel)",
    "author": [
      {
        "name": "cttanData",
        "url": {}
      }
    ],
    "date": "2021-05-29",
    "categories": [],
    "contents": "\n\nContents\n1.0 Introduction\n2.0 Visualisation Critique2.1 Clarity\n2.2 Aesthetic\n\n3.0 Alternate Visualisation3.1 Assumption\n3.2 Clarity\n3.3 Aesthetic\n\n4.0 Visualisation Design\n5.0 Step-by-Step Guid\n6.0 Derived Insights\n7.0 Conclusion\n8.0 Recommendation\n\n1.0 Introduction\nThe data visualisation below is created by using data under the sub-section of Merchandise Trade by Region/Market from the Department of Statistics, Singapore.\n\nFigure1.1. Merchandise Trade of Top Six Trading Countries, 2019-2020\n2.0 Visualisation Critique\n2.1 Clarity\nGeneric Title with NO Lead In. The title does not convey the intent or message behind the visualisation well as it was just a generic title indicating the merchandise trade of the top 6 trading countries for Singapore from 2019 to 2020. There was no lead in to explain as well and the reader do not know how the top 6 were being determined. i.e. total trade value from 2019 to 2020 or ..? It was unclear whether the intent was to provide information on intra and/or inter comparison of trade balance or total trade transaction values over the study period among the countries. Perhaps it could also be used to convey COVID impact on trade transaction among the top 6 trading countries by comparing pre-COVID (2019) to COVID period (2020). Given that it only show import and export values over the study period, we presumed it was more interested in trade balance rather than total values.\nUnsynchronised Y Axis. An unsynchronised Y axis scale for import / export values across all the charts would increase the cognitive load in processing the comparison. By quick view, it was unclear on the ranking order of the top 6 trading countries. It was also difficult to discern the trade balance across the study period for the respective country to Singapore. E.g. Hong Kong export values seemed to be higher than its import for selected 2019 period. However, the truth was that Hong Kong import was always higher than the export and the misleading perspective was caused by different Y axis scale.\nInconsistent X Axis. The lack of minor markings or gridlines for the X axis have increased the difficulties in determining the exact import/export values over time. e.g. import values for Oct 2020. It was also interesting to observe that the respective country graph seemed to be of different width from one another even though they (less Japan) had the same study period. Additional confusion was created where Japan has a shorter period as compared to the rest. It made one wonder whether there were no values during the missing period and what were the start and end periods. Thus, eventually, what the charts were trying to compare with a different time period.\nArea or Bar Chart. Even though time was a continuous variable, given the data points was collated monthly rather than daily, the suitability of an area chart was put in question. i.e would a bar chart at monthly interval be better. Nonetheless, this could be debatable. Thus, from the chart, it was difficult to determine the exact import and export values at specific time period. The X axis lacked the minor marking either by quarterly or monthly. As marking on yearly basis only would pose difficulties to correlate the values across both axes. Moreover, such marking would help to ease the corelation of observed trending over specific events occurred in that time period.\n2.2 Aesthetic\nAttention to Details. The font size for country was larger than the title. Moreover, the title alignment seemed to be skewed towards the right due to space extended by the legend. Font size for axis naming and values were relative the same. There was a lack of font typography and hierarchical design. All these made the chart aesthetically non-attractive.\nWhite Space. Personally, there could be too many white spaces among the country charts and the chart sizes were inconsistent. This could be due to the need to repeat Y axis naming for the respective chart and how the 6 charts were combined. More space should be allocated to the chart where an enlarge chart could provide better clarity and quality on the details within.\nColour of Choice. Technically, one could not really fault the choice of colour for import and export respectively. Presuming the intention of the chart was to determine the trade difference overtime, then colour choice like pink and blue might be better option. Pink could represent the negative connotation. E.g. Pink for import. When one saw pink colour over the area chart, it would connote import was greater than export, something that the designer would like to give a negative connotation.\n3.0 Alternate Visualisation\nThe proposed alternative design is as follows.\n3.1 Assumption\nThe main intention was to provide a visual understanding on how import and export values of the top 6 trading countries for Singapore were affected by the world-wide COVID pandemic. This would be done by comparing the respective monthly values in 2020 (COVID year) against 2019 (pre-COVID year). Eventually, at annual transaction values. Information associated with trade balance, year-to-year trade growth, growth from previous month would be secondary objectives and to be done only when time and space permit.\n3.2 Clarity\n3.3 Aesthetic\n4.0 Visualisation Design\n5.0 Step-by-Step Guid\nNo\nStep\nAction\n1\nUse excel to remove all unnecessary data points and information associated with the tables for respective worksheet. Only variables associated with the top 6 countries pluse “Total Merchandised…” from Jan 19 to Dec 20 would be retained.\n\n2\nLoad the excel file into Tableau Prep Builder. Drag the “Export” worksheet on the left into the canvas. Click the “+” icon for Export and select “Pivot”\n\n3\nSelect all the date range field. Drag and drop at the “Pivoted Fields” box.\n\n4\nThis is what one will see under “Pivot Results”. One could click on the field to verify the pivot.\n\n5\nDouble click into “Total Merchandised Export…” within the “Variables” column under “Pivot Results” field. Delete the word “Export”.\n\n6\nRename the columns.i.e “Variables” to “Country”, “Pivot Names” to “Date”, “Pivot Values” to “Export Values”. Repeat Step 2 to 6 for “Import” worksheet. Ensure the field “Total Merchandised..” has the same spelling in both sheets\n\n7\nDrag either “Pivot” box in the canvas to the other box. A “Join” symbol will appear. Drop the box within. Set the parameters for join under the “Applied Join Clause”. One can check under “Summary of Join Results” to see mismatched values that will display as red colour. The join will be simple unless one made mistake in Step 5, else remove the duplicated columns.\n\n8\nClick the “+” icon from the “Join” box in the canvas and select “cleaning”.\n\n9\nSelect “Split Values” and “Automatic Split” from the “Country” Column to extract the country name from the variable. Remove duplicated columns.\n\n10\nChange the data type for the respective column.\n\n11\nClick the “+” icon from the “Clean” box in the canvas and select “Output”. Set the parameters for saving the new data set.\n\n12\nLoad the saved excel into Tableau Desktop and drag the saved sheet into the canvas. Create calculated new field from Import and Export Variables to determine the new variables of Import and Export for year 2019 and 2020 respective. eg “Import 2019”. Multiplied by 1000 to account for the normalised value of “thousand” (removed in Step 9) Step 3 could also be used to instead of this step by pivoting the variable by year.\n\n13\nCreate calculated new field to determine the monthly “Total Trade” by summing the Import and Export variables.\n\n14\nDrag the variables “Country” and “Date” into the Columns as Dimension. Filter “Total Merchandised” from the “Country” dimension. Then change the “YEAR(DATE)” into “MONTH(Date)” to have a monthly x axis wrapped by the Country. Drag the variables “Export 2019”, “Export 2020”, “Import 2019” and “Import 2020” into the Rows as Measures. 4 x Bar Charts for the respective rows variables will be created. Note that Export Charts are positioned.\n\n15\nSelect “Dual Axis” from the drop down of “SUM(Export 2020)”. This would merge both Export charts. Right click on the Export Y axis and select “Synchronise Axis” to make “Export 2019” and “Export 2020” have similar Y axis scale. Repeat the steps for the Import Measures.\n\n16\nSort the “Country” based on total trade value in a descending order by clicking the “Country” dimension and select the “Sort…” in the drop down, select the parameters based on the displayed image. This is to allow quick visual on the rank order for top 6. It is verified that the similar descending order regardless of period i.e. (2019+2020) or (2020)\n\n17\nAt the Marks area, set the same bar size (to become a vertical line) and colour for the “Sum(Import 2019)” and “Sum(Export 2019)” variables. For 2020 variables, lower the colour opacity but could use different colour to represent import and export bar chart respectively.\n\n18\nTo improve clarity for the 2019 values, right click on the any 2019 Y axis and select “Move marks to front”.\n\n19\nFor both Y axes, change the range to Fixed and set the end value to “8,100,000,000”. Amend the Axis Title. Set Scale to “Reversed” ONLY for Import Y axis. Intention is to create a symmetrical scale along the x axis to ease comparison.\n\n20\nDrag the variables “Export 2020” into “Export 2020” Marks shelf. Double click into the measure and type “> SUM([Export 2019])”. It will change into a logic Dimension. Assign colour to it.\n\n21\nFor chart, one can observe that when “Export 2020” is less than “Export 2019” (i.e.negative Yr-to-Yr import values), the bar chart will change to pink colour. This is to ease the visualisation on impact. Repeat for “Import 2020”.\n\n22\nRemove unnecessary headers, format the remainder headers, adjust font size, colour, grid lines inking and change the format of “Month(Date)” into “First Letter”.\n\n23\nRight click on the top chart and select “Annotate -> Area” to add “Export” into the chart. Adjust the colour tone and repeat for the Import Chart. Purpose is to do the enhanced the inking on which bar chart represent export or import.\n\n24\nDownload the country flag icon from the internet and save it in the directory:Tableau Repository. (Need to create flag folder) Drag the “Country” into Columns shelf in a new sheet. At Marks shelf, change the chart into “Shape” and drag “Country” into “Shapes”. Click on the “Shapes” and assigned the respective flag icon to the variable. Repeat for SG flag by using “Total Merchandised” (The visualisation has been designed using resources (country images) from Flaticon.com by Freepik\n)\n25\nCreate the calculated field for “Total Trade 2019” based on the image. Repated for “Total Trade 2020”.\n)\n26\nCreate the calulated field for “Annual Growth” a logic measure to determine whether Trade Value in 2020 is more than Trade Value in 2019. Then calculated field for “Annual Growth%” reference to the image. The purpose is to compute annual Year-over-Year growth for each country.\n)\n27\nOn a new sheet, drag “Country” and “Total Trade 2020” to row shelf. Convert the former to a Dimension with discrete value rather than keep it as Measure. Filter “Country” to only “Total Merchandised” and “Edit Aliases …” to “SG 2020 Total Trade Value:”. Drag “Annual Growth” and “Annual Growth%” into Marks Shelf Colour and Text respectively. The former will create the logic and thus visual contrast to determine whether positive or negative growth. The latter is to compute the growth value. Format the growth value by using customer for number. We will be using icon to represent positive and negative to ease visualisation.\n)\n28.Repeat step 27 but with “SG 2020 Total Trade Value:” filter off from “Country”. Drag the variables into Column rather than Row Shelf.\n)\n\n29.Create a Year-over-Year Growth for total trade values on each month in 2020. On the new sheet, drag “Country” and “Date” into Columns Shelf with the required filter and setting to month. drag “Annual Growth%” into Marks Shelf Colour and Size respectively as Measure. This is to create the visual cue for negative / positive values with size to indicate the difference magnitude.\n)\n\n6.0 Derived Insights\n7.0 Conclusion\n8.0 Recommendation\nSOURCE: ENTERPRISE SINGAPORE, DATA generated by SingSTat Table Builder on 17/05/21\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-29T21:49:16+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My DataViz Learning Journey",
    "description": "Welcome to our new blog, My DataViz Learning! A home where DataViz assignment was documented after burning days and nights on it. We hope you enjoy learning what we have shared! :-) YOLO",
    "author": [
      {
        "name": "cttanData",
        "url": {}
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-25T01:43:08+08:00",
    "input_file": {}
  }
]
