[
  {
    "path": "posts/2021-05-25-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "The first DataViz MakeOver task for ISSS608: Visual Analytics.\n(Tools: Tableau Desktop 2021.1, Tableau Prep Builder 2021.1 & Office 365 Excel)",
    "author": [
      {
        "name": "cttanData",
        "url": {}
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\n\nContents\n1.0 Introduction\n2.0 Visualisation Critique2.1 Clarity\n2.2 Aesthetic\n\n3.0 Alternate Visualisation3.1 Assumption\n3.2 Clarity & Aesthetic\n3.3 Concerns\n\n4.0 Visualisation Design\n5.0 Step-by-Step Guid\n6.0 Derived Insights\n7.0 Conclusion\n8.0 Recommendation\n\n1.0 Introduction\nThe data visualisation below is created by using data under the sub-section of Merchandise Trade by Region/Market from the Department of Statistics, Singapore.\n\nFigure1.1. Merchandise Trade of Top Six Trading Countries, 2019-2020\n2.0 Visualisation Critique\n2.1 Clarity\nGeneric Title with NO Lead In. The title does not convey the intent or message behind the visualisation well as it was just a generic title indicating the merchandise trade of the top 6 trading countries for Singapore from 2019 to 2020. There was no lead in to explain as well and the reader do not know how the top 6 were being determined. i.e. total trade value from 2019 to 2020 or ..? It was unclear whether the intent was to provide information on intra and/or inter comparison of trade balance or total trade transaction values over the study period among the countries. Perhaps it could also be used to convey COVID impact on trade transaction among the top 6 trading countries by comparing pre-COVID (2019) to COVID period (2020).\nUnsynchronised Y Axis. An unsynchronised Y axis scale for import / export values across all the charts would increase the cognitive load in processing the comparison. By quick view, it was unclear on the ranking order of the top 6 trading countries. It was also difficult to discern the trade balance across the study period for the respective country to Singapore. E.g. Hong Kong export values seemed to be higher than its import for selected 2019 period. However, the truth was that Hong Kong import was always higher than the export and the misleading perspective was caused by different Y axis scale.\nInconsistent X Axis. The lack of minor markings or grid lines for the X axis have increased the difficulties in determining the exact import/export values over time. e.g. import values for Oct 2020. It was also interesting to observe that the respective country graph seemed to be of different width from one another even though they (less Japan) had the same study period. Additional confusion was created where Japan has a shorter period as compared to the rest. It made one wonder whether there were no values during the missing period and what were the start and end periods. Thus, eventually, what the charts were trying to compare with a different time period.\nArea or Bar Chart. Even though time was a continuous variable, given the data points was collated monthly rather than daily, the suitability of an area chart was put in question. i.e would a bar chart at monthly interval be better. Nonetheless, this could be debatable. Thus, from the chart, it was difficult to determine the exact import and export values at specific time period. The X axis lacked the minor marking either by quarterly or monthly. As marking on yearly basis only would pose difficulties to correlate the values across both axes. Moreover, such marking would help to ease the corelation of observed trending over specific events occurred in that time period.\n2.2 Aesthetic\nAttention to Details. The font size for country was larger than the title. Moreover, the title alignment seemed to be skewed towards the right due to space extended by the legend. Font size for axis naming and values were relative the same. There was a lack of font typography and hierarchical design. All these made the chart aesthetically non-attractive.\nWhite Space. Personally, there could be too many white spaces among the country charts and the chart sizes were inconsistent. This could be due to the need to repeat Y axis naming for the respective chart and how the 6 charts were combined. More space should be allocated to the chart where an enlarge chart could provide better clarity and quality on the details within.\nColour of Choice. Technically, one could not really fault the choice of colour for import and export respectively. Presuming the intention of the chart was to determine the trade difference overtime, then colour choice like pink and blue might be better option. Pink could represent the negative connotation. E.g. Pink for import. When one saw pink colour over the area chart, it would connote import was greater than export, something that the designer would like to give a negative connotation.\n3.0 Alternate Visualisation\nThe proposed alternative design is as follow:\n\n\n3.1 Assumption\nThe intention is to provide marco view in the total trade transaction values and growth for Singapore and it top 6 trading countries in 2020 based line against 2019 for Year-over-Year (Y-o-Y) comparison. It shall also ease the understanding on growth at the export and import values for each country. Trend lines over 2020 might also be derived. Nonetheless. the visualisaiton will not focus on insight for on trade balance with individual countries so not to make it too clutter.\n3.2 Clarity & Aesthetic\nMeaningful title and lead in will be used in the visualisation. The axes will also be synchronised when two variables are used. Vertical Bar chart based on monthly import and export values. To create symmetrical along X axis by fixing the same end point for Y axis. The base chart be an rotated 90 pyramid bar chart. Given it is an rotated pyramid chart, Export will be position above the X axis where Import will be below. Rationale is than more export will create trade surplus and vice verse. The main chart will show 2020 trade values i.e. Bar where the 2019 values will be overlay by using a smaller bar i.e vertical link. Inking will be done to ease cognitive load in identify “Export” and “Import” areas. The top 6 will also be arranged in a descending order to study the impact across them. Total trade values and growth parameters will also be inked on the chart. Suitable colour contrast, symbol and its size will also be used to ease the cognitive load in processing 2019 vs 2020 trade values, negative and positive growth / impact.\n3.3 Concerns\nAssociation with Export and Import Location. It has been a long deliberation whether it should be rotated, traditional pyramid chart with time line in the Y axis and Import/Export on the X axis or stack bar or area chart. The concern on using pyramid chart has been that viewer might quickly associated it with a population chart and it cognitive difficult to read. Concern on rotated pyramid chart will be why import is a negative value which could be counter intuitive. The negative about pyramid chart is that one cannot really a quick overview on the total trade value at respective month as compared to stack chart. Eventually, decided on rotated pyramid chart. Could use different colours for bar chart to connote Import vs Export but worried it could be too colourful. Eventually, other than axis naming, explain in lead in etc, inking of “Export” and “Import” words in the chart is also adopted.\nConfused over 2019 vs 2020 Values. There are too many parameters to play in this visualisation. The main variable shall be 2020 but 2019 is important to determine Y-o-Y growth rate and impact. Hopefully, different symbol, colour contrast and legend should ease the association.\nInformation Overload. To avoid this, attempt to design in 4 layers across the chart.\nFirst Layer is the title with lead in to explain the visualisation intent.\nSecond Layer: Marco total trade value and Y-o-Y growth for Singapore and the top 6 countries. (On hindsight, should add the percentage of country trade values to total Singapore trade)\nThird Layer. 2020 Import and Export values for each country overlay with 2019 values. Intention is to show macro view on impact to growth rate for respective value.\nFourth Layer. Y-o-Y growth for total trade values at monthly level for each country. Understand broad trend line on growth rate over the month in 2020 for each country.\n\n4.0 Visualisation Design\nThe final visualisation design can be found on here in Tableau Public.\n5.0 Step-by-Step Guid\nNo\nStep\nAction\n1\nUse excel to remove all unnecessary data points and information associated with the tables for respective worksheet. Only variables associated with the top 6 countries pluse “Total Merchandised…” from Jan 19 to Dec 20 would be retained.\n\n2\nLoad the excel file into Tableau Prep Builder. Drag the “Export” worksheet on the left into the canvas. Click the “+” icon for Export and select “Pivot”\n\n3\nSelect all the date range field. Drag and drop at the “Pivoted Fields” box.\n\n4\nThis is what one will see under “Pivot Results”. One could click on the field to verify the pivot.\n\n5\nDouble click into “Total Merchandised Export…” within the “Variables” column under “Pivot Results” field. Delete the word “Export”.\n\n6\nRename the columns.i.e “Variables” to “Country”, “Pivot Names” to “Date”, “Pivot Values” to “Export Values”. Repeat Step 2 to 6 for “Import” worksheet. Ensure the field “Total Merchandised..” has the same spelling in both sheets\n\n7\nDrag either “Pivot” box in the canvas to the other box. A “Join” symbol will appear. Drop the box within. Set the parameters for join under the “Applied Join Clause”. One can check under “Summary of Join Results” to see mismatched values that will display as red colour. The join will be simple unless one made mistake in Step 5, else remove the duplicated columns.\n\n8\nClick the “+” icon from the “Join” box in the canvas and select “cleaning”.\n\n9\nSelect “Split Values” and “Automatic Split” from the “Country” Column to extract the country name from the variable. Remove duplicated columns.\n\n10\nChange the data type for the respective column.\n\n11\nClick the “+” icon from the “Clean” box in the canvas and select “Output”. Set the parameters for saving the new data set.\n\n12\nLoad the saved excel into Tableau Desktop and drag the saved sheet into the canvas. Create calculated new field from Import and Export Variables to determine the new variables of Import and Export for year 2019 and 2020 respective. eg “Import 2019”. Multiplied by 1000 to account for the normalised value of “thousand” (removed in Step 9) Step 3 could also be used to instead of this step by pivoting the variable by year.\n\n13\nCreate calculated new field to determine the monthly “Total Trade” by summing the Import and Export variables.\n\n14\nDrag the variables “Country” and “Date” into the Columns as Dimension. Filter “Total Merchandised” from the “Country” dimension. Then change the “YEAR(DATE)” into “MONTH(Date)” to have a monthly x axis wrapped by the Country. Drag the variables “Export 2019”, “Export 2020”, “Import 2019” and “Import 2020” into the Rows as Measures. 4 x Bar Charts for the respective rows variables will be created. Note that Export Charts are positioned.\n\n15\nSelect “Dual Axis” from the drop down of “SUM(Export 2020)”. This would merge both Export charts. Right click on the Export Y axis and select “Synchronise Axis” to make “Export 2019” and “Export 2020” have similar Y axis scale. Repeat the steps for the Import Measures.\n\n16\nSort the “Country” based on total trade value in a descending order by clicking the “Country” dimension and select the “Sort…” in the drop down, select the parameters based on the displayed image. This is to allow quick visual on the rank order for top 6. It is verified that the similar descending order regardless of period i.e. (2019+2020) or (2020)\n\n17\nAt the Marks area, set the same bar size (to become a vertical line) and colour for the “Sum(Import 2019)” and “Sum(Export 2019)” variables. For 2020 variables, lower the colour opacity but could use different colour to represent import and export bar chart respectively.\n\n18\nTo improve clarity for the 2019 values, right click on the any 2019 Y axis and select “Move marks to front”.\n\n19\nFor both Y axes, change the range to Fixed and set the end value to “8,100,000,000”. Amend the Axis Title. Set Scale to “Reversed” ONLY for Import Y axis. Intention is to create a symmetrical scale along the x axis to ease comparison.\n\n20\nDrag the variables “Export 2020” into “Export 2020” Marks shelf. Double click into the measure and type “> SUM([Export 2019])”. It will change into a logic Dimension. Assign colour to it.\n\n21\nFor chart, one can observe that when “Export 2020” is less than “Export 2019” (i.e.negative Yr-to-Yr import values), the bar chart will change to pink colour. This is to ease the visualisation on impact. Repeat for “Import 2020”.\n\n22\nRemove unnecessary headers, format the remainder headers, adjust font size, colour, grid lines inking and change the format of “Month(Date)” into “First Letter”.\n\n23\nRight click on the top chart and select “Annotate -> Area” to add “Export” into the chart. Adjust the colour tone and repeat for the Import Chart. Purpose is to do the enhanced the inking on which bar chart represent export or import.\n\n24\nDownload the country flag icon from the internet and save it in the directory:(“My Tableau Repository”). (Need to create flag folder) Drag the “Country” into Columns shelf in a new sheet. At Marks shelf, change the chart into “Shape” and drag “Country” into “Shapes”. Click on the “Shapes” and assigned the respective flag icon to the variable. Repeat for SG flag by using “Total Merchandised” (The visualisation has been designed using resources (country images) from Flaticon.com by Freepik\n\n25\nCreate the calculated field for “Total Trade 2019” based on the image. Repated for “Total Trade 2020”.\n\n26\nCreate the calulated field for “Annual Growth” a logic measure to determine whether Trade Value in 2020 is more than Trade Value in 2019. Then calculated field for “Annual Growth%” reference to the image. The purpose is to compute annual Y-o-Y growth for each country.\n\n27\nOn a new sheet, drag “Country” and “Total Trade 2020” to row shelf. Convert the former to a Dimension with discrete value rather than keep it as Measure. Filter “Country” to only “Total Merchandised” and “Edit Aliases …” to “SG 2020 Total Trade Value:”. Drag “Annual Growth” and “Annual Growth%” into Marks Shelf Colour and Text respectively. The former will create the logic and thus visual contrast to determine whether positive or negative growth. The latter is to compute the growth value. Format the growth value by using customer for number. We will be using icon to represent positive and negative to ease visualisation.\n\n28\nRepeat step 27 but with “SG 2020 Total Trade Value:” filter off from “Country”. Drag the variables into Column rather than Row Shelf.\n\n29\nCreate a Y-o-Y Growth for total trade values on each month in 2020. On the new sheet, drag “Country” and “Date” into Columns Shelf with the required filter and setting to month. drag “Annual Growth%” into Marks Shelf Colour and Size respectively as Measure. This is to create the visual cue for negative / positive values with size to indicate the difference magnitude.\n\n30.\nCombine all the sheets into a dashboard and realign the sheets to achieve the required aesthatics outcome. Add Title, Lead In and Source and Legend to allow view quick comprehension on the visualisation intent.\n\n6.0 Derived Insights\n\n\nThe derived insights are:\nMostly Negative in Growth. The Y-o-Y growth for the total trade values for SG is negative (i.e-5.20%) followed by it main trading partners in descending order Malaysia (-8.46%), USA (-2.47%), Japan(-1.69%) and China (-0.81%). Nonetheless it is surprising that SG has strong positive growth with Taiwan (+13.04%) and Hong Kong (+5.61%). Moreover, the negative growth in China is deemed to be low given the country has been hit with COVID in early 2020.\nUneven Impact to Monthly Import and Export Values for the Top 6 Countries.\nFront End Negative Impact. China trade is affected generally a bit more on export from Singapore than import during the first 6 mths of 2020. Thereafter, negative import growth some of the remaining months but the last 6mths has seen relatively strong trade growth due to higher export from Singapore.\nSharp Point Negative Impact. The trade between Singapore and Malaysia have been badly hit during Mar to May 2020. This has been the period where both implemented country lock down such that direct land trade via Johor has been affected. As Malaysia has been implementing a series lock down even after that, one can observe its continue impact to Export from Singapore to Malaysia. Overall trade growth has been negative in the last 6 mths of 2020.\nLop-Sided Impact. Generally, Y-o-Y import growth for Singapore to USA has generally been negative, while positive for export. Nonetheless, the overall trade growth has been negative due to higher negative growth in import which offset positive growth in export.\nLimited Impact. Interesting, both Taiwan and Hong Kong have mainly experienced positive growth with Singapore. In 2020, both countries have generally been known to have relative small number of COVID cases.\nTail End Negative Impact. Generally, the fluctuation in trade values for Japan has been less drastic. Nonetheless, both trade values experience negative growth in the last 6 mths of 2020. Somehow it might be correlated to the progressive increase in the number of COVID cases in later part of the year.\n\nTrending for Trade Growth in 2020 base on Monthly Trade Values. From the “Y-o-Y Growth” chart at the bottom of the visualisation, one can use colour and size of the square to have a macro view on the total trade trending between Singapore and the each country. Both Taiwan and Hong Kong have seemed to be on a growing trend based on the darker blue and bigger square. China has also progressive growth after the initial dip. Japan trade growth has been dropping steadily. Similar to Malaysia less the high negative growth during Singapore Circuit Breaker. USA has been a roller coaster ride but generally more negative than positive. Actually, it will be interesting to see how the trending will carry on into 2021 where pandemic has generally been control in most but no all, but some been hit with second or third wave of COVID attack.\n7.0 Conclusion\nThe visualisation has provided a macro view of total merchandised trade values for SG and its top 6 trading partner. A quick insights on the Y-o-Y growth on annual trade values, import and export values for each trading country with SG under the pandemic COVID 19. It also shed marco insight on monthly growth in 2020 showing signs of recovery for selected countries. Nonetheless, the future is still uncertain in this pandemic era as country about subsequent COVID attack. Effectively, trade economics can be affected by numerous factors and thus without deep research,one cannot confidently concluded the negative growth can be fully attributed to the pandemic while selected incidents with Malaysia are attributable.\n8.0 Recommendation\nFuture exploration to enhance understanding on trade growth can focus on 2 areas as follows:\nMicro View on Merchandised Trade. To research on which types of goods and services have resulted in the negative or positive growth with respective country import and export values. With the deeper understanding in quantitative approach, the ability to correlate the insights and discern whether the impact on growth could be attributable to COVID or other international policy or economics dynamics.\nCausation to Growth in Merchandised Trade. COVID 19 can be a causation to the growth insights discerned from the visualisation at the macro level. However, other political or economical factors can also have impacted how good and services flow globally. eg Trade wars between US and China, Hong Kong political situation, Taiwan growth in electronic supply chain etc could have affected global trade flow. Need to have deeper research into the qualitative area to understand the impact to Singapore Trade.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-30T13:53:42+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My DataViz Learning Journey",
    "description": "Welcome to our new blog, My DataViz Learning! A home where DataViz assignment was documented after burning days and nights on it. We hope you enjoy learning what we have shared! :-) YOLO",
    "author": [
      {
        "name": "cttanData",
        "url": {}
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\n\n\n\n",
    "preview": {},
    "last_modified": "2021-05-25T01:43:08+08:00",
    "input_file": {}
  }
]
